[
  {
    "title": "EaseHire",
    "descriptionEN": "Informal job portal. Facilitates the connection between people with specific needs and those qualified to meet them, offering security for both parties.",
    "descriptionES": "Portal de trabajos informales. Facilita la conexión entre personas con necesidades específicas y aquellas capacitadas para resolverlas, ofreciendo seguridad para ambas partes.",
    "repository": "https://github.com/SebaPerez90/EaseHire-Back",
    "deploy": "https://easehire.vercel.app/",
    "skills": ["NestJS", "Next.js", "Typescript", "PostgreSQL", "CSS", "AWS"],
    "detailedDescriptionEN": [
      "EaseHire is an informal job portal that facilitates the connection between people with specific needs and those qualified to meet them, offering security for both parties. This platform stands out by reducing bureaucracy in the process of searching and hiring for informal services, a common problem in Argentina. EaseHire solves the difficulty of finding professionals for everyday tasks, such as expanding a house or fixing something broken, as many sites focus on stable and formal jobs, overlooking these small but important daily needs."
    ],
    "detailedDescriptionES": [
      "EaseHire es un portal de trabajos informales que facilita la conexión entre personas con necesidades específicas y aquellas capacitadas para resolverlas, ofreciendo seguridad para ambas partes. Esta plataforma se destaca por reducir la burocracia en el proceso de búsqueda y contratación de servicios informales, lo cual es un problema común en Argentina. EaseHire resuelve la dificultad de encontrar profesionales para tareas cotidianas, como agrandar una casa o reparar algo roto, ya que muchos sitios están enfocados en trabajos estables y formales, dejando de lado estas pequeñas pero importantes necesidades diarias."
    ],
    "featuresEN": [
      "Secure connection between users and providers.",
      "Search by location, skills, and availability.",
      "Ratings and reviews for providers.",
      "Profile customization to showcase skills and experience.",
      "Live messaging and notifications."
    ],
    "featuresES": [
      "Conexión segura entre usuarios y proveedores.",
      "Búsqueda por ubicación, habilidades y disponibilidad.",
      "Calificaciones y comentarios sobre proveedores.",
      "Personalización de perfiles para mostrar habilidades y experiencia.",
      "Mensajería y notificaciones en vivo."
    ],
    "screen_shoots": ["/images/easehire.jpg"],
    "development_stage": true
  },
  {
    "title": "E-commerce",
    "descriptionES": "Aplicación backend de e-commerce con funcionalidades que necesita un negocio lista para ser implementada, proyecto académico.",
    "descriptionEN": "Backend e-commerce application with necessary functionalities for a business ready to be implemented, academic project.",
    "repository": "https://github.com/SebaPerez90/e-comerce-backend",
    "deploy": "https://ecomerce-m4.onrender.com/api",
    "skills": ["NestJS", "Docker", "Typescript", "PostgreSQL", "TypeORM"],
    "detailedDescriptionEN": [
      "E-commerce is a backend application designed to manage the operations of an online business. This academic project provides a complete and ready-to-implement solution, covering everything from product and user management to order processing. It uses NestJS to build a scalable architecture, Docker for containerization, and PostgreSQL along with TypeORM for efficient database management. Security has been enhanced with the implementation of JWT and bcrypt for secure authentication and password handling. It takes a while to load due to the free plan of the Render service, which is slow, but the deployment is active."
    ],
    "detailedDescriptionES": [
      "E-commerce es una aplicación backend diseñada para gestionar las operaciones de un negocio en línea. Este proyecto académico proporciona una solución completa y lista para implementar, abarcando desde la gestión de productos y usuarios hasta el procesamiento de pedidos. Utiliza NestJS para construir una arquitectura escalable, Docker para contenerización, y PostgreSQL junto con TypeORM para una gestión de base de datos eficiente. La seguridad se ha reforzado con la implementación de JWT y bcrypt para el manejo seguro de autenticación y contraseñas. Tarda en cargar debido al plan gratuito del servicio Render, el cual es lento, pero esta el deploy activo."
    ],
    "featuresEN": [
      "Enhanced authentication and security with JWT and bcrypt.",
      "Management of products, users, and orders.",
      "Generation of detailed reports on sales and users.",
      "Route protection through roles."
    ],
    "featuresES": [
      "Autenticación y seguridad mejoradas con JWT y bcrypt.",
      "Gestión de productos, usuarios y pedidos.",
      "Generación de informes detallados sobre ventas y usuarios.",
      "Protección de rutas mediante roles."
    ],
    "screen_shoots": ["/images/e-comerce.jpg"]
  },
  {
    "title": "Weather App",
    "descriptionES": "Aplicación que proporciona clima actual y pronósticos, incluyendo temperatura y condiciones climáticas, proyecto académico.",
    "descriptionEN": "Application that provides current weather and forecasts, including temperature and weather conditions, academic project.",
    "repository": "https://github.com/SebaPerez90/WeatherApp",
    "deploy": "https://sebaperez90.github.io/WeatherApp/",
    "skills": ["React", "Tailwind", "Javascript", "Sass"],
    "detailedDescriptionEN": [
      "Weather App is an academic project developed to provide accurate information on current weather and forecasts. Using React and Tailwind, it offers an intuitive interface facilitating the consultation of weather data anytime and anywhere. Ideal for understanding the implementation of interactive interfaces and the integration of external APIs."
    ],
    "detailedDescriptionES": [
      "Weather App es una proyecto académico desarrollado para proporcionar información precisa sobre el clima actual y los pronósticos. Utilizando React y Tailwind, ofrece una interfaz intuitiva facilitando la consulta de datos meteorológicos en cualquier momento y lugar. Ideal para entender la implementación de interfaces interactivas y la integración de APIs externas."
    ],
    "featuresEN": [
      "Real-time weather information.",
      "Detailed daily forecasts.",
      "Intuitive and responsive interface.",
      "Customization of measurement units (Celsius and Fahrenheit).",
      "User preferences customization (theme and language)."
    ],
    "featuresES": [
      "Información meteorológica en tiempo real.",
      "Pronósticos detallados por días.",
      "Interfaz intuitiva y responsive.",
      "Personalización de unidades de medición (celsius y fahrenheit).",
      "Personalización de preferencias de usuarios (tema e idioma)."
    ],
    "screen_shoots": ["/images/weather-app.jpg"]
  }
]
